# 13일차

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data = pd.DataFrame([['홍길동',99,'1999/1/1'],
                    ['한희구',85,'1996/6/20'],
                    ['둘리',51,'2005/1/1']],
                   columns=['이름','성적','생일'])
data

    이름  성적         생일
0  홍길동  99   1999/1/1
1  한희구  85  1996/6/20
2   둘리  51   2005/1/1

In [3]:
data.이름.map(lambda s: s[1:])

0    길동
1    희구
2     리
Name: 이름, dtype: object

In [4]:
data['이름부분']=data.이름.map(lambda s: s[1:])

In [5]:
data

    이름  성적         생일 이름부분
0  홍길동  99   1999/1/1   길동
1  한희구  85  1996/6/20   희구
2   둘리  51   2005/1/1    리

In [6]:
data['성']=data.이름.map(lambda s: s[0] if len(s)==3 else '김')
data

    이름  성적         생일 이름부분  성
0  홍길동  99   1999/1/1   길동  홍
1  한희구  85  1996/6/20   희구  한
2   둘리  51   2005/1/1    리  김

In [7]:
data.이름.str[0]

0    홍
1    한
2    둘
Name: 이름, dtype: object

In [8]:
data.이름.str[1:]

0    길동
1    희구
2     리
Name: 이름, dtype: object

In [9]:
data

    이름  성적         생일 이름부분  성
0  홍길동  99   1999/1/1   길동  홍
1  한희구  85  1996/6/20   희구  한
2   둘리  51   2005/1/1    리  김

In [11]:
data[(data.이름>'라')&(data.성적>90)]

    이름  성적        생일 이름부분  성
0  홍길동  99  1999/1/1   길동  홍

In [12]:
data['날짜']=pd.to_datetime(data.생일)
data

    이름  성적         생일 이름부분  성         날짜
0  홍길동  99   1999/1/1   길동  홍 1999-01-01
1  한희구  85  1996/6/20   희구  한 1996-06-20
2   둘리  51   2005/1/1    리  김 2005-01-01

In [13]:
data[data.날짜.dt.dayofweek>4]

   이름  성적        생일 이름부분  성         날짜
2  둘리  51  2005/1/1    리  김 2005-01-01

In [15]:
data=pd.DataFrame([[99,88,'서울'],[76,89,'부산'],
                  [86,95,'원주'],[63,76,'서울']],
                 columns=['국어','영어','지역'])
data

   국어  영어  지역
0  99  88  서울
1  76  89  부산
2  86  95  원주
3  63  76  서울

In [16]:
data.지역.value_counts()

서울    2
부산    1
원주    1
Name: 지역, dtype: int64

In [17]:
list(data.지역.value_counts().index)

['서울', '부산', '원주']